# file for Andrey
import time


def timer():
    f = time.time()+20
    temp = int((f-(f-20))//1)
    while time.time() < f:
        if temp-temp//4 == int((f-time.time())//1) or temp//2 == int((f-time.time())//1) or temp//4 == int((f-time.time())//1):
            print('Осталось {} секунд'.format(int((f-time.time())//1)))
    print('ты проиграл')


def game():
    a = 0
    while True:
        p1 = input('Напишите горот ')
        last_letter1 = p1[len(p1)-1]
        a += 1
        if a > 1 and a % 2 != 0:
            if last_letter2.upper() == p1[0]:
                pass
            else:
                print(
                    'Буква, на которую оканчивается прошлый город не совпадает с первой буквой нового города')
                while last_letter2.upper() != p1[0]:
                    if last_letter2.upper() != p1[0]:
                        p1 = input('Напишите горот ')
                        if last_letter2.upper() != p1[0]:
                            print(
                                'Буква, на которую оканчивается прошлый город не совпадает с первой буквой нового города')
                    else:
                        break
                pass
        last_letter1 = p1[len(p1)-1]
        p2 = input('Напишите город ')
        a += 1
        last_letter2 = p2[len(p2)-1]
        if a % 2 == 0:
            if last_letter1.upper() == p2[0]:
                pass
            else:
                print(
                    'Буква, на которую оканчивается прошлый город не совпадает с первой буквой нового города')
                while last_letter1.upper() != p2[0]:
                    if last_letter1.upper() != p2[0]:
                        p2 = input('Напишите город ')
                        if last_letter1.upper() != p2[0]:
                            print(
                                'Буква, на которую оканчивается прошлый город не совпадает с первой буквой нового города')
                    else:
                        break
                pass
        last_letter2 = p2[len(p2)-1]


game()
# Комментарии по деталям кода:
#
# Название функции на русском языке - это грубая ошибка
# Стараемся использовать в названии только буквы нижнего регистра (например, t вместр T)
# Логика работы таймера всё ещё неправильная, поскольку sleep погружает в сон всю программу,
# а использовать для этого asyncio, которое погружает в сон только одну функцию - это очень сложно,
# долго и похоже на использование катаны для нарезки бутербродов
# Я рекомендую посмотреть на другие варианты проверки условий и использовать флаги
# Зачем нужно два input подряд внутри game() - не понятно
# Что-то придумаю - придумывай
# Основной код не дописан асболютно, его даже комментировать не буду
# 26 строка - можно проще и короче, но и так работает, поэтому на твоё усмотрение
# Зачем печатать функция вместо того, чтобы её просто вызвать - непонятно
#
# Комментарии по коду в общем:
#
# Начинай написание кода с простого, поскольку сейчас у тебя не работает ничего
# А могла бы быть хотя бы одна рабочая функция
# Сначала - логика, потом код, а не наоборот
# У тебя главная проблема таймера - логическая, а не программисткая, см. строки 35-38
# Крайне рекомендую сначала на листочке или в заметках разработать логику,
# а только потом бросаться писать код в надежде, что по ходу разберёшься
