# file for Andrey
import time

def timer():
    f = time.time()+20
    temp = int((f-(f-20))//1)
    while time.time() < f:
        #if temp-temp//4 == int((f-time.time())//1) or temp//2 == int((f-time.time())//1) or temp//4 == int((f-time.time())//1):
        print('Осталось {} секунд'.format(int((f-time.time())//1)))
    print('ты проиграл')

timer()

def oda(a,b):
    txt='Буква, на которую оканчивается прошлый город не совпадает с первой буквой нового города'
    if a.upper() != b[0].upper():
        print(txt)
        while a.upper() != b[0]:
            b = input('Напишите город ')
            if a.upper() != b[0]:
                print(txt)

def game():
    a = 0
    while True:
        p1 = input('Напишите горот ')
        last_letter1 = p1[-1]
        if last_letter1=='ь':
            last_letter1=p1[-2]
        a += 1
        if a > 1 and a % 2 != 0:
            oda(last_letter2,p1)
        last_letter1 = p1[-1]
        if last_letter1=='ь':
            last_letter1=p1[-2]
        p2 = input('Напишите город ')
        a += 1
        last_letter2 = p2[-1]
        if last_letter2=='ь':
            last_letter2=p2[-2]
        if a % 2 == 0:
            oda(last_letter1,p2)
        last_letter2 = p2[-1]
        if last_letter2=='ь':
            last_letter2=p2[-2]
game()


# Основной код предварительно(!) работает, классно
# Разберись с таймером и проверь, что введённого игроком города раньше не было




# Комментарии по деталям кода от 09.11:
#
# По поводу таймера рекомендации старые:
# Я рекомендую посмотреть на другие варианты проверки условий и использовать флаги
# Должно помочь
# 
# В game() огромный кусок кода дублируется почти целиком (или совсем целиком, я по символам не сравнивал)
# Это ОЧЕНЬ плохой способ написания кода
# Если ты захочешь что-то исправить в одном месте и забудешь исправить в другом,
# тебе будет очень весело исправлять ошибки
# Даже если не забудешь, я напоминаю, что Python нацелен именно на написание 
# короткого (в разумных пределах) кода, твой за эти пределы выходит явно
# Думай, как это переписывать так, чтобы код не дублировался       
#
# Не тестировал, работает или нет, как только пройдёт твои тесты - будем тестировать,
# а пока есть шанс, что ты всё переделаешь, ничего не проверяю
# 
# Ещё очень не нравится if условие pass else в нескольких местах
# Так быть не должно, я думаю, ты понимаешь, как это записать правильно
# 
# За совсем мелкие недочёты пока молчу, но тему со срезами списков почитай на досуге, если хочешь
#     
# Комментарии по коду в общем:
#
# Начинай написание кода с простого, поскольку сейчас у тебя не работает ничего
# А могла бы быть хотя бы одна рабочая функция
# Сначала - логика, потом код, а не наоборот
# У тебя главная проблема таймера - логическая, а не программисткая, см. строки 35-38
# Крайне рекомендую сначала на листочке или в заметках разработать логику,
# а только потом бросаться писать код в надежде, что по ходу разберёшься
