# Комментарии 07.11.2021 17:11 для Аян
# Во-первых, функции - круто, ты молодец!!!
# Во-вторых, функции должны принимать только необходимые параметры, чтобы их было удобно использовать
# Проанализируй, какие входные параметры тебе действительно нужны, пожалуйста
# Вторая функция - что-то странное, а не что-то важное
# input по усолчанию считывает строку, его не надо лишний раз переводить в str
# Что возвращает функция proverka???
# 
# Комментарии 07.11.2021 17:30 для Аян
# Всё ещё не во всех функциях функции принимают те входные параметры, которые им реально нужны
# Логику работы пока не проверяю, вы сами можете тестировать
# Но предварительно выглядит достаточно просто и правдоподобно во многих местах